---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.GetReinforcementRoundingManager
source: html/5149cdb5-f393-6b9e-e101-0fc3384d1236.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.GetReinforcementRoundingManager Method

Returns an object for managing reinforcement rounding override settings.

## Syntax (C#)
```csharp
public RebarRoundingManager GetReinforcementRoundingManager()
```

## Returns
The rounding manager.